In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [4]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
   ....:                      [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = np.nan

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [20]:
df.iloc[:4, 1] = np.nan

In [21]:
df.iloc[:2, 2] = np.nan

In [22]:
df

          0         1         2
0  0.519548       NaN       NaN
1  0.368142       NaN       NaN
2  0.383736       NaN  0.970744
3  0.167220       NaN  0.599779
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935

In [23]:
df.dropna()

          0         1         2
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935

In [24]:
df.dropna(thresh=2)

          0         1         2
2  0.383736       NaN  0.970744
3  0.167220       NaN  0.599779
4  0.709035 -2.438602  0.113115
5  0.595299  0.446581 -1.683550
6  0.531050 -1.479494  0.889935